Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4l/include/component/component_usart.h
// USART mode
#define US_MR_USART_MODE_Pos        0            /**< \brief (US_MR_USART) Usart Mode */
#define US_MR_USART_MODE_Msk        (0xFu << US_MR_USART_MODE_Pos)
#define US_MR_USART_MODE(value)     ((US_MR_USART_MODE_Msk & ((value) << US_MR_USART_MODE_Pos)))
#define   US_MR_USART_MODE_NORMAL   (0x0u <<  0) /**< \brief (US_MR_USART) Normal */
#define   US_MR_USART_MODE_RS485    (0x1u <<  0) /**< \brief (US_MR_USART) RS485 */
#define   US_MR_USART_MODE_HARDWARE (0x2u <<  0) /**< \brief (US_MR_USART) Hardware Handshaking */
#define   US_MR_USART_MODE_MODEM    (0x3u <<  0) /**< \brief (US_MR_USART) Modem */
#define   US_MR_USART_MODE_ISO7816_T0 (0x4u <<  0) /**< \brief (US_MR_USART) IS07816 Protocol: T = 0 */
#define   US_MR_USART_MODE_ISO7816_T1 (0x6u <<  0) /**< \brief (US_MR_USART) IS07816 Protocol: T = 1 */
#define   US_MR_USART_MODE_IRDA     (0x8u <<  0) /**< \brief (US_MR_USART) IrDA */
#define   US_MR_USART_MODE_LIN_MASTER (0xAu <<  0) /**< \brief (US_MR_USART) LIN Master */
#define   US_MR_USART_MODE_LIN_SLAVE (0xBu <<  0) /**< \brief (US_MR_USART) LIN Slave */
#define   US_MR_USART_MODE_SPI_MASTER (0xEu <<  0) /**< \brief (US_MR_USART) SPI Master */
#define   US_MR_USART_MODE_SPI_SLAVE (0xFu <<  0) /**< \brief (US_MR_USART) SPI Slave */
#define US_MR_USART_USCLKS_Pos      4            /**< \brief (US_MR_USART) Clock Selection */
#define US_MR_USART_USCLKS_Msk      (0x3u << US_MR_USART_USCLKS_Pos)
#define US_MR_USART_USCLKS(value)   ((US_MR_USART_USCLKS_Msk & ((value) << US_MR_USART_USCLKS_Pos)))
#define   US_MR_USART_USCLKS_MCK    (0x0u <<  4) /**< \brief (US_MR_USART) MCK */
#define   US_MR_USART_USCLKS_MCK_DIV (0x1u <<  4) /**< \brief (US_MR_USART) MCK / DIV */
#define   US_MR_USART_USCLKS_2      (0x2u <<  4) /**< \brief (US_MR_USART) Reserved */
#define   US_MR_USART_USCLKS_SCK    (0x3u <<  4) /**< \brief (US_MR_USART) SCK */
#define US_MR_USART_CHRL_Pos        6            /**< \brief (US_MR_USART) Character Length. */
#define US_MR_USART_CHRL_Msk        (0x3u << US_MR_USART_CHRL_Pos)
#define US_MR_USART_CHRL(value)     ((US_MR_USART_CHRL_Msk & ((value) << US_MR_USART_CHRL_Pos)))
#define   US_MR_USART_CHRL_5        (0x0u <<  6) /**< \brief (US_MR_USART) 5 bits */
#define   US_MR_USART_CHRL_6        (0x1u <<  6) /**< \brief (US_MR_USART) 6 bits */
#define   US_MR_USART_CHRL_7        (0x2u <<  6) /**< \brief (US_MR_USART) 7 bits */
#define   US_MR_USART_CHRL_8        (0x3u <<  6) /**< \brief (US_MR_USART) 8 bits */
#define US_MR_USART_SYNC_Pos        8            /**< \brief (US_MR_USART) Synchronous Mode Select */
#define US_MR_USART_SYNC            (0x1u << US_MR_USART_SYNC_Pos)
#define   US_MR_USART_SYNC_0        (0x0u <<  8) /**< \brief (US_MR_USART) USART operates in Synchronous Mode */
#define   US_MR_USART_SYNC_1        (0x1u <<  8) /**< \brief (US_MR_USART) USART operates in Asynchronous Mode */
#define US_MR_USART_PAR_Pos         9            /**< \brief (US_MR_USART) Parity Type */
#define US_MR_USART_PAR_Msk         (0x7u << US_MR_USART_PAR_Pos)
#define US_MR_USART_PAR(value)      ((US_MR_USART_PAR_Msk & ((value) << US_MR_USART_PAR_Pos)))
#define   US_MR_USART_PAR_EVEN      (0x0u <<  9) /**< \brief (US_MR_USART) Even parity */
#define   US_MR_USART_PAR_ODD       (0x1u <<  9) /**< \brief (US_MR_USART) Odd parity */
#define   US_MR_USART_PAR_SPACE     (0x2u <<  9) /**< \brief (US_MR_USART) Parity forced to 0 (Space) */
#define   US_MR_USART_PAR_MARK      (0x3u <<  9) /**< \brief (US_MR_USART) Parity forced to 1 (Mark) */
#define   US_MR_USART_PAR_NONE      (0x4u <<  9) /**< \brief (US_MR_USART) No Parity */
#define   US_MR_USART_PAR_5         (0x5u <<  9) /**< \brief (US_MR_USART) No Parity */
#define   US_MR_USART_PAR_MULTI     (0x6u <<  9) /**< \brief (US_MR_USART) Multi-drop mode */
#define   US_MR_USART_PAR_7         (0x7u <<  9) /**< \brief (US_MR_USART) Multi-drop mode */
#define US_MR_USART_NBSTOP_Pos      12           /**< \brief (US_MR_USART) Number of Stop Bits */
#define US_MR_USART_NBSTOP_Msk      (0x3u << US_MR_USART_NBSTOP_Pos)
#define US_MR_USART_NBSTOP(value)   ((US_MR_USART_NBSTOP_Msk & ((value) << US_MR_USART_NBSTOP_Pos)))
#define   US_MR_USART_NBSTOP_1      (0x0u << 12) /**< \brief (US_MR_USART) 1 stop bit */
#define   US_MR_USART_NBSTOP_1_5    (0x1u << 12) /**< \brief (US_MR_USART) 1.5 stop bits (Only valid if SYNC=0) */
#define   US_MR_USART_NBSTOP_2      (0x2u << 12) /**< \brief (US_MR_USART) 2 stop bits */
#define   US_MR_USART_NBSTOP_3      (0x3u << 12) /**< \brief (US_MR_USART) Reserved */
#define US_MR_USART_CHMODE_Pos      14           /**< \brief (US_MR_USART) Channel Mode */
#define US_MR_USART_CHMODE_Msk      (0x3u << US_MR_USART_CHMODE_Pos)
#define US_MR_USART_CHMODE(value)   ((US_MR_USART_CHMODE_Msk & ((value) << US_MR_USART_CHMODE_Pos)))
#define   US_MR_USART_CHMODE_NORMAL (0x0u << 14) /**< \brief (US_MR_USART) Normal Mode */
#define   US_MR_USART_CHMODE_ECHO   (0x1u << 14) /**< \brief (US_MR_USART) Automatic Echo. Receiver input is connected to the TXD pin */
#define   US_MR_USART_CHMODE_LOCAL_LOOP (0x2u << 14) /**< \brief (US_MR_USART) Local Loopback. Transmitter output is connected to the Receiver Input */
#define   US_MR_USART_CHMODE_REMOTE_LOOP (0x3u << 14) /**< \brief (US_MR_USART) Remote Loopback. RXD pin is internally connected to the TXD pin */
#define US_MR_USART_MSBF_Pos        16           /**< \brief (US_MR_USART) Bit Order */
#define US_MR_USART_MSBF            (0x1u << US_MR_USART_MSBF_Pos)
#define   US_MR_USART_MSBF_LSBF     (0x0u << 16) /**< \brief (US_MR_USART) Least Significant Bit first */
#define   US_MR_USART_MSBF_MSBF     (0x1u << 16) /**< \brief (US_MR_USART) Most Significant Bit first */
#define US_MR_USART_MODE9_Pos       17           /**< \brief (US_MR_USART) 9-bit Character Length */
#define US_MR_USART_MODE9           (0x1u << US_MR_USART_MODE9_Pos)
#define   US_MR_USART_MODE9_0       (0x0u << 17) /**< \brief (US_MR_USART) CHRL defines character length */
#define   US_MR_USART_MODE9_1       (0x1u << 17) /**< \brief (US_MR_USART) 9-bit character length */
#define US_MR_USART_CLKO_Pos        18           /**< \brief (US_MR_USART) Clock Output Select */
#define US_MR_USART_CLKO            (0x1u << US_MR_USART_CLKO_Pos)
#define   US_MR_USART_CLKO_0        (0x0u << 18) /**< \brief (US_MR_USART) The USART does not drive the SCK pin */
#define   US_MR_USART_CLKO_1        (0x1u << 18) /**< \brief (US_MR_USART) The USART drives the SCK pin if USCLKS does not select the external clock SCK */
#define US_MR_USART_OVER_Pos        19           /**< \brief (US_MR_USART) Oversampling Mode */
#define US_MR_USART_OVER            (0x1u << US_MR_USART_OVER_Pos)
#define   US_MR_USART_OVER_X16      (0x0u << 19) /**< \brief (US_MR_USART) 16x Oversampling */
#define   US_MR_USART_OVER_X8       (0x1u << 19) /**< \brief (US_MR_USART) 8x Oversampling */
#define US_MR_USART_INACK_Pos       20           /**< \brief (US_MR_USART) Inhibit Non Acknowledge */
#define US_MR_USART_INACK           (0x1u << US_MR_USART_INACK_Pos)
#define   US_MR_USART_INACK_0       (0x0u << 20) /**< \brief (US_MR_USART) The NACK is generated */
#define   US_MR_USART_INACK_1       (0x1u << 20) /**< \brief (US_MR_USART) The NACK is not generated */
#define US_MR_USART_DSNACK_Pos      21           /**< \brief (US_MR_USART) Disable Successive NACK */
#define US_MR_USART_DSNACK          (0x1u << US_MR_USART_DSNACK_Pos)
#define   US_MR_USART_DSNACK_0      (0x0u << 21) /**< \brief (US_MR_USART) NACK is sent on the ISO line as soon as a parity error occurs in the received character (unless INACK is set) */
#define   US_MR_USART_DSNACK_1      (0x1u << 21) /**< \brief (US_MR_USART) Successive parity errors are counted up to the value specified in the MAX_ITERATION field. These parity errors generatea NACK on the ISO line. As soon as this value is reached, no additional NACK is sent on the ISO line. The flag ITERATION is asserted */
#define US_MR_USART_VAR_SYNC_Pos    22           /**< \brief (US_MR_USART) Variable synchronization of command/data sync Start Frame Delimiter */
#define US_MR_USART_VAR_SYNC        (0x1u << US_MR_USART_VAR_SYNC_Pos)
#define   US_MR_USART_VAR_SYNC_0    (0x0u << 22) /**< \brief (US_MR_USART) User defined configuration of command or data sync field depending on SYNC value */
#define   US_MR_USART_VAR_SYNC_1    (0x1u << 22) /**< \brief (US_MR_USART) The sync field is updated when a character is written into THR register */
#define US_MR_USART_INVDATA_Pos     23           /**< \brief (US_MR_USART) Inverted data */
#define US_MR_USART_INVDATA         (0x1u << US_MR_USART_INVDATA_Pos)
#define US_MR_USART_MAX_ITERATION_Pos 24           /**< \brief (US_MR_USART) Max interation */
#define US_MR_USART_MAX_ITERATION_Msk (0x7u << US_MR_USART_MAX_ITERATION_Pos)
#define US_MR_USART_MAX_ITERATION(value) ((US_MR_USART_MAX_ITERATION_Msk & ((value) << US_MR_USART_MAX_ITERATION_Pos)))
#define US_MR_USART_FILTER_Pos      28           /**< \brief (US_MR_USART) Infrared Receive Line Filter */
#define US_MR_USART_FILTER          (0x1u << US_MR_USART_FILTER_Pos)
#define   US_MR_USART_FILTER_0      (0x0u << 28) /**< \brief (US_MR_USART) The USART does not filter the receive line */
#define   US_MR_USART_FILTER_1      (0x1u << 28) /**< \brief (US_MR_USART) The USART filters the receive line using a three-sample filter (1/16-bit clock) (2 over 3 majority) */
#define US_MR_USART_MAN_Pos         29           /**< \brief (US_MR_USART) Manchester Encoder/Decoder Enable */
#define US_MR_USART_MAN             (0x1u << US_MR_USART_MAN_Pos)
#define   US_MR_USART_MAN_0         (0x0u << 29) /**< \brief (US_MR_USART) Manchester Encoder/Decoder is disabled */
#define   US_MR_USART_MAN_1         (0x1u << 29) /**< \brief (US_MR_USART) Manchester Encoder/Decoder is enabled */
#define US_MR_USART_MODSYNC_Pos     30           /**< \brief (US_MR_USART) Manchester Synchronization Mode */
#define US_MR_USART_MODSYNC         (0x1u << US_MR_USART_MODSYNC_Pos)
#define   US_MR_USART_MODSYNC_0     (0x0u << 30) /**< \brief (US_MR_USART) The Manchester Start bit is a 0 to 1 transition */
#define   US_MR_USART_MODSYNC_1     (0x1u << 30) /**< \brief (US_MR_USART) The Manchester Start bit is a 1 to 0 transition */
#define US_MR_USART_ONEBIT_Pos      31           /**< \brief (US_MR_USART) Start Frame Delimiter selector */
#define US_MR_USART_ONEBIT          (0x1u << US_MR_USART_ONEBIT_Pos)
#define   US_MR_USART_ONEBIT_0      (0x0u << 31) /**< \brief (US_MR_USART) Start Frame delimiter is COMMAND or DATA SYNC */
#define   US_MR_USART_ONEBIT_1      (0x1u << 31) /**< \brief (US_MR_USART) Start Frame delimiter is One Bit */
#define US_MR_USART_MASK            0xF7FFFFFFu  /**< \brief (US_MR_USART) MASK Register */

// Any mode
#define US_MR_MODE_Pos              0            /**< \brief (US_MR) Usart Mode */
#define US_MR_MODE_Msk              (0xFu << US_MR_MODE_Pos)
#define US_MR_MODE(value)           ((US_MR_MODE_Msk & ((value) << US_MR_MODE_Pos)))
#define   US_MR_MODE_NORMAL         (0x0u <<  0) /**< \brief (US_MR) Normal */
#define   US_MR_MODE_RS485          (0x1u <<  0) /**< \brief (US_MR) RS485 */
#define   US_MR_MODE_HARDWARE       (0x2u <<  0) /**< \brief (US_MR) Hardware Handshaking */
#define   US_MR_MODE_MODEM          (0x3u <<  0) /**< \brief (US_MR) Modem */
#define   US_MR_MODE_ISO7816_T0     (0x4u <<  0) /**< \brief (US_MR) IS07816 Protocol: T = 0 */
#define   US_MR_MODE_ISO7816_T1     (0x6u <<  0) /**< \brief (US_MR) IS07816 Protocol: T = 1 */
#define   US_MR_MODE_IRDA           (0x8u <<  0) /**< \brief (US_MR) IrDA */
#define   US_MR_MODE_LIN_MASTER     (0xAu <<  0) /**< \brief (US_MR) LIN Master */
#define   US_MR_MODE_LIN_SLAVE      (0xBu <<  0) /**< \brief (US_MR) LIN Slave */
#define   US_MR_MODE_SPI_MASTER     (0xEu <<  0) /**< \brief (US_MR) SPI Master */
#define   US_MR_MODE_SPI_SLAVE      (0xFu <<  0) /**< \brief (US_MR) SPI Slave */
#define US_MR_USCLKS_Pos            4            /**< \brief (US_MR) Clock Selection */
#define US_MR_USCLKS_Msk            (0x3u << US_MR_USCLKS_Pos)
#define US_MR_USCLKS(value)         ((US_MR_USCLKS_Msk & ((value) << US_MR_USCLKS_Pos)))
#define   US_MR_USCLKS_MCK          (0x0u <<  4) /**< \brief (US_MR) MCK */
#define   US_MR_USCLKS_MCK_DIV      (0x1u <<  4) /**< \brief (US_MR) MCK / DIV */
#define   US_MR_USCLKS_2            (0x2u <<  4) /**< \brief (US_MR) Reserved */
#define   US_MR_USCLKS_SCK          (0x3u <<  4) /**< \brief (US_MR) SCK */
#define US_MR_CHRL_Pos              6            /**< \brief (US_MR) Character Length. */
#define US_MR_CHRL_Msk              (0x3u << US_MR_CHRL_Pos)
#define US_MR_CHRL(value)           ((US_MR_CHRL_Msk & ((value) << US_MR_CHRL_Pos)))
#define   US_MR_CHRL_5              (0x0u <<  6) /**< \brief (US_MR) 5 bits */
#define   US_MR_CHRL_6              (0x1u <<  6) /**< \brief (US_MR) 6 bits */
#define   US_MR_CHRL_7              (0x2u <<  6) /**< \brief (US_MR) 7 bits */
#define   US_MR_CHRL_8              (0x3u <<  6) /**< \brief (US_MR) 8 bits */
#define US_MR_CPHA_Pos              8            /**< \brief (US_MR) SPI CLock Phase */
#define US_MR_CPHA                  (0x1u << US_MR_CPHA_Pos)
#define   US_MR_CPHA_0              (0x0u <<  8) /**< \brief (US_MR) Data is changed on the leading edge of SPCK and captured on the following edge of SPCK */
#define   US_MR_CPHA_1              (0x1u <<  8) /**< \brief (US_MR) Data is captured on the leading edge of SPCK and changed on the following edge of SPCK */
#define US_MR_SYNC_Pos              8            /**< \brief (US_MR) Synchronous Mode Select */
#define US_MR_SYNC                  (0x1u << US_MR_SYNC_Pos)
#define   US_MR_SYNC_0              (0x0u <<  8) /**< \brief (US_MR) USART operates in Synchronous Mode */
#define   US_MR_SYNC_1              (0x1u <<  8) /**< \brief (US_MR) USART operates in Asynchronous Mode */
#define US_MR_PAR_Pos               9            /**< \brief (US_MR) Parity Type */
#define US_MR_PAR_Msk               (0x7u << US_MR_PAR_Pos)
#define US_MR_PAR(value)            ((US_MR_PAR_Msk & ((value) << US_MR_PAR_Pos)))
#define   US_MR_PAR_EVEN            (0x0u <<  9) /**< \brief (US_MR) Even parity */
#define   US_MR_PAR_ODD             (0x1u <<  9) /**< \brief (US_MR) Odd parity */
#define   US_MR_PAR_SPACE           (0x2u <<  9) /**< \brief (US_MR) Parity forced to 0 (Space) */
#define   US_MR_PAR_MARK            (0x3u <<  9) /**< \brief (US_MR) Parity forced to 1 (Mark) */
#define   US_MR_PAR_NONE            (0x4u <<  9) /**< \brief (US_MR) No Parity */
#define   US_MR_PAR_5               (0x5u <<  9) /**< \brief (US_MR) No Parity */
#define   US_MR_PAR_MULTI           (0x6u <<  9) /**< \brief (US_MR) Multi-drop mode */
#define   US_MR_PAR_7               (0x7u <<  9) /**< \brief (US_MR) Multi-drop mode */
#define US_MR_NBSTOP_Pos            12           /**< \brief (US_MR) Number of Stop Bits */
#define US_MR_NBSTOP_Msk            (0x3u << US_MR_NBSTOP_Pos)
#define US_MR_NBSTOP(value)         ((US_MR_NBSTOP_Msk & ((value) << US_MR_NBSTOP_Pos)))
#define   US_MR_NBSTOP_1            (0x0u << 12) /**< \brief (US_MR) 1 stop bit */
#define   US_MR_NBSTOP_1_5          (0x1u << 12) /**< \brief (US_MR) 1.5 stop bits (Only valid if SYNC=0) */
#define   US_MR_NBSTOP_2            (0x2u << 12) /**< \brief (US_MR) 2 stop bits */
#define   US_MR_NBSTOP_3            (0x3u << 12) /**< \brief (US_MR) Reserved */
#define US_MR_CHMODE_Pos            14           /**< \brief (US_MR) Channel Mode */
#define US_MR_CHMODE_Msk            (0x3u << US_MR_CHMODE_Pos)
#define US_MR_CHMODE(value)         ((US_MR_CHMODE_Msk & ((value) << US_MR_CHMODE_Pos)))
#define   US_MR_CHMODE_NORMAL       (0x0u << 14) /**< \brief (US_MR) Normal Mode */
#define   US_MR_CHMODE_ECHO         (0x1u << 14) /**< \brief (US_MR) Automatic Echo. Receiver input is connected to the TXD pin */
#define   US_MR_CHMODE_LOCAL_LOOP   (0x2u << 14) /**< \brief (US_MR) Local Loopback. Transmitter output is connected to the Receiver Input */
#define   US_MR_CHMODE_REMOTE_LOOP  (0x3u << 14) /**< \brief (US_MR) Remote Loopback. RXD pin is internally connected to the TXD pin */
#define US_MR_CPOL_Pos              16           /**< \brief (US_MR) SPI Clock Polarity */
#define US_MR_CPOL                  (0x1u << US_MR_CPOL_Pos)
#define   US_MR_CPOL_ZERO           (0x0u << 16) /**< \brief (US_MR) The inactive state value of SPCK is logic level zero */
#define   US_MR_CPOL_ONE            (0x1u << 16) /**< \brief (US_MR) The inactive state value of SPCK is logic level one */
#define US_MR_MSBF_Pos              16           /**< \brief (US_MR) Bit Order */
#define US_MR_MSBF                  (0x1u << US_MR_MSBF_Pos)
#define   US_MR_MSBF_LSBF           (0x0u << 16) /**< \brief (US_MR) Least Significant Bit first */
#define   US_MR_MSBF_MSBF           (0x1u << 16) /**< \brief (US_MR) Most Significant Bit first */
#define US_MR_MODE9_Pos             17           /**< \brief (US_MR) 9-bit Character Length */
#define US_MR_MODE9                 (0x1u << US_MR_MODE9_Pos)
#define   US_MR_MODE9_0             (0x0u << 17) /**< \brief (US_MR) CHRL defines character length */
#define   US_MR_MODE9_1             (0x1u << 17) /**< \brief (US_MR) 9-bit character length */
#define US_MR_CLKO_Pos              18           /**< \brief (US_MR) Clock Output Select */
#define US_MR_CLKO                  (0x1u << US_MR_CLKO_Pos)
#define   US_MR_CLKO_0              (0x0u << 18) /**< \brief (US_MR) The USART does not drive the SCK pin */
#define   US_MR_CLKO_1              (0x1u << 18) /**< \brief (US_MR) The USART drives the SCK pin if USCLKS does not select the external clock SCK */
#define US_MR_OVER_Pos              19           /**< \brief (US_MR) Oversampling Mode */
#define US_MR_OVER                  (0x1u << US_MR_OVER_Pos)
#define   US_MR_OVER_X16            (0x0u << 19) /**< \brief (US_MR) 16x Oversampling */
#define   US_MR_OVER_X8             (0x1u << 19) /**< \brief (US_MR) 8x Oversampling */
#define US_MR_INACK_Pos             20           /**< \brief (US_MR) Inhibit Non Acknowledge */
#define US_MR_INACK                 (0x1u << US_MR_INACK_Pos)
#define   US_MR_INACK_0             (0x0u << 20) /**< \brief (US_MR) The NACK is generated */
#define   US_MR_INACK_1             (0x1u << 20) /**< \brief (US_MR) The NACK is not generated */
#define US_MR_DSNACK_Pos            21           /**< \brief (US_MR) Disable Successive NACK */
#define US_MR_DSNACK                (0x1u << US_MR_DSNACK_Pos)
#define   US_MR_DSNACK_0            (0x0u << 21) /**< \brief (US_MR) NACK is sent on the ISO line as soon as a parity error occurs in the received character (unless INACK is set) */
#define   US_MR_DSNACK_1            (0x1u << 21) /**< \brief (US_MR) Successive parity errors are counted up to the value specified in the MAX_ITERATION field. These parity errors generatea NACK on the ISO line. As soon as this value is reached, no additional NACK is sent on the ISO line. The flag ITERATION is asserted */
#define US_MR_VAR_SYNC_Pos          22           /**< \brief (US_MR) Variable synchronization of command/data sync Start Frame Delimiter */
#define US_MR_VAR_SYNC              (0x1u << US_MR_VAR_SYNC_Pos)
#define   US_MR_VAR_SYNC_0          (0x0u << 22) /**< \brief (US_MR) User defined configuration of command or data sync field depending on SYNC value */
#define   US_MR_VAR_SYNC_1          (0x1u << 22) /**< \brief (US_MR) The sync field is updated when a character is written into THR register */
#define US_MR_INVDATA_Pos           23           /**< \brief (US_MR) Inverted data */
#define US_MR_INVDATA               (0x1u << US_MR_INVDATA_Pos)
#define US_MR_MAX_ITERATION_Pos     24           /**< \brief (US_MR) Max interation */
#define US_MR_MAX_ITERATION_Msk     (0x7u << US_MR_MAX_ITERATION_Pos)
#define US_MR_MAX_ITERATION(value)  ((US_MR_MAX_ITERATION_Msk & ((value) << US_MR_MAX_ITERATION_Pos)))
#define US_MR_FILTER_Pos            28           /**< \brief (US_MR) Infrared Receive Line Filter */
#define US_MR_FILTER                (0x1u << US_MR_FILTER_Pos)
#define   US_MR_FILTER_0            (0x0u << 28) /**< \brief (US_MR) The USART does not filter the receive line */
#define   US_MR_FILTER_1            (0x1u << 28) /**< \brief (US_MR) The USART filters the receive line using a three-sample filter (1/16-bit clock) (2 over 3 majority) */
#define US_MR_MAN_Pos               29           /**< \brief (US_MR) Manchester Encoder/Decoder Enable */
#define US_MR_MAN                   (0x1u << US_MR_MAN_Pos)
#define   US_MR_MAN_0               (0x0u << 29) /**< \brief (US_MR) Manchester Encoder/Decoder is disabled */
#define   US_MR_MAN_1               (0x1u << 29) /**< \brief (US_MR) Manchester Encoder/Decoder is enabled */
#define US_MR_MODSYNC_Pos           30           /**< \brief (US_MR) Manchester Synchronization Mode */
#define US_MR_MODSYNC               (0x1u << US_MR_MODSYNC_Pos)
#define   US_MR_MODSYNC_0           (0x0u << 30) /**< \brief (US_MR) The Manchester Start bit is a 0 to 1 transition */
#define   US_MR_MODSYNC_1           (0x1u << 30) /**< \brief (US_MR) The Manchester Start bit is a 1 to 0 transition */
#define US_MR_ONEBIT_Pos            31           /**< \brief (US_MR) Start Frame Delimiter selector */
#define US_MR_ONEBIT                (0x1u << US_MR_ONEBIT_Pos)
#define   US_MR_ONEBIT_0            (0x0u << 31) /**< \brief (US_MR) Start Frame delimiter is COMMAND or DATA SYNC */
#define   US_MR_ONEBIT_1            (0x1u << 31) /**< \brief (US_MR) Start Frame delimiter is One Bit */
#define US_MR_MASK                  0xF7FFFFFFu  /**< \brief (US_MR) MASK Register */

