Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4l/include/component/component_usart.h
/* -------- US_IMR : (USART Offset: 0x10) (R/  32) Interrupt Mask Register -------- */
#define US_IMR_OFFSET               0x10         /**< \brief (US_IMR offset) Interrupt Mask Register */
#define US_IMR_RESETVALUE           0x00000000   /**< \brief (US_IMR reset_value) Interrupt Mask Register */

// LIN mode
#define US_IMR_LIN_RXRDY_Pos        0            /**< \brief (US_IMR_LIN) RXRDY Interrupt Mask */
#define US_IMR_LIN_RXRDY            (0x1u << US_IMR_LIN_RXRDY_Pos)
#define   US_IMR_LIN_RXRDY_0        (0x0u <<  0) /**< \brief (US_IMR_LIN) The interrupt is disabled */
#define   US_IMR_LIN_RXRDY_1        (0x1u <<  0) /**< \brief (US_IMR_LIN) The interrupt is enabled */
#define US_IMR_LIN_TXRDY_Pos        1            /**< \brief (US_IMR_LIN) TXRDY Interrupt Mask */
#define US_IMR_LIN_TXRDY            (0x1u << US_IMR_LIN_TXRDY_Pos)
#define   US_IMR_LIN_TXRDY_0        (0x0u <<  1) /**< \brief (US_IMR_LIN) The interrupt is disabled */
#define   US_IMR_LIN_TXRDY_1        (0x1u <<  1) /**< \brief (US_IMR_LIN) The interrupt is enabled */
#define US_IMR_LIN_RXBRK_Pos        2            /**< \brief (US_IMR_LIN) Receiver Break Interrupt Mask */
#define US_IMR_LIN_RXBRK            (0x1u << US_IMR_LIN_RXBRK_Pos)
#define   US_IMR_LIN_RXBRK_0        (0x0u <<  2) /**< \brief (US_IMR_LIN) The interrupt is disabled */
#define   US_IMR_LIN_RXBRK_1        (0x1u <<  2) /**< \brief (US_IMR_LIN) The interrupt is enabled */
#define US_IMR_LIN_ENDRX_Pos        3            /**< \brief (US_IMR_LIN) End of Receive Transfer Interrupt Mask */
#define US_IMR_LIN_ENDRX            (0x1u << US_IMR_LIN_ENDRX_Pos)
#define   US_IMR_LIN_ENDRX_0        (0x0u <<  3) /**< \brief (US_IMR_LIN) The interrupt is disabled */
#define   US_IMR_LIN_ENDRX_1        (0x1u <<  3) /**< \brief (US_IMR_LIN) The interrupt is enabled */
#define US_IMR_LIN_ENDTX_Pos        4            /**< \brief (US_IMR_LIN) End of Transmit Interrupt Mask */
#define US_IMR_LIN_ENDTX            (0x1u << US_IMR_LIN_ENDTX_Pos)
#define   US_IMR_LIN_ENDTX_0        (0x0u <<  4) /**< \brief (US_IMR_LIN) The interrupt is disabled */
#define   US_IMR_LIN_ENDTX_1        (0x1u <<  4) /**< \brief (US_IMR_LIN) The interrupt is enabled */
#define US_IMR_LIN_OVRE_Pos         5            /**< \brief (US_IMR_LIN) Overrun Error Interrupt Mask */
#define US_IMR_LIN_OVRE             (0x1u << US_IMR_LIN_OVRE_Pos)
#define   US_IMR_LIN_OVRE_0         (0x0u <<  5) /**< \brief (US_IMR_LIN) The interrupt is disabled */
#define   US_IMR_LIN_OVRE_1         (0x1u <<  5) /**< \brief (US_IMR_LIN) The interrupt is enabled */
#define US_IMR_LIN_FRAME_Pos        6            /**< \brief (US_IMR_LIN) Framing Error Interrupt Mask */
#define US_IMR_LIN_FRAME            (0x1u << US_IMR_LIN_FRAME_Pos)
#define   US_IMR_LIN_FRAME_0        (0x0u <<  6) /**< \brief (US_IMR_LIN) The interrupt is disabled */
#define   US_IMR_LIN_FRAME_1        (0x1u <<  6) /**< \brief (US_IMR_LIN) The interrupt is enabled */
#define US_IMR_LIN_PARE_Pos         7            /**< \brief (US_IMR_LIN) Parity Error Interrupt Mask */
#define US_IMR_LIN_PARE             (0x1u << US_IMR_LIN_PARE_Pos)
#define   US_IMR_LIN_PARE_0         (0x0u <<  7) /**< \brief (US_IMR_LIN) The interrupt is disabled */
#define   US_IMR_LIN_PARE_1         (0x1u <<  7) /**< \brief (US_IMR_LIN) The interrupt is enabled */
#define US_IMR_LIN_TIMEOUT_Pos      8            /**< \brief (US_IMR_LIN) Time-out Interrupt Mask */
#define US_IMR_LIN_TIMEOUT          (0x1u << US_IMR_LIN_TIMEOUT_Pos)
#define   US_IMR_LIN_TIMEOUT_0      (0x0u <<  8) /**< \brief (US_IMR_LIN) The interrupt is disabled */
#define   US_IMR_LIN_TIMEOUT_1      (0x1u <<  8) /**< \brief (US_IMR_LIN) The interrupt is enabled */
#define US_IMR_LIN_TXEMPTY_Pos      9            /**< \brief (US_IMR_LIN) TXEMPTY Interrupt Mask */
#define US_IMR_LIN_TXEMPTY          (0x1u << US_IMR_LIN_TXEMPTY_Pos)
#define   US_IMR_LIN_TXEMPTY_0      (0x0u <<  9) /**< \brief (US_IMR_LIN) The interrupt is disabled */
#define   US_IMR_LIN_TXEMPTY_1      (0x1u <<  9) /**< \brief (US_IMR_LIN) The interrupt is enabled */
#define US_IMR_LIN_ITER_Pos         10           /**< \brief (US_IMR_LIN) Iteration Interrupt Mask */
#define US_IMR_LIN_ITER             (0x1u << US_IMR_LIN_ITER_Pos)
#define   US_IMR_LIN_ITER_0         (0x0u << 10) /**< \brief (US_IMR_LIN) The interrupt is disabled */
#define   US_IMR_LIN_ITER_1         (0x1u << 10) /**< \brief (US_IMR_LIN) The interrupt is enabled */
#define US_IMR_LIN_TXBUFE_Pos       11           /**< \brief (US_IMR_LIN) Buffer Empty Interrupt Mask */
#define US_IMR_LIN_TXBUFE           (0x1u << US_IMR_LIN_TXBUFE_Pos)
#define   US_IMR_LIN_TXBUFE_0       (0x0u << 11) /**< \brief (US_IMR_LIN) The interrupt is disabled */
#define   US_IMR_LIN_TXBUFE_1       (0x1u << 11) /**< \brief (US_IMR_LIN) The interrupt is enabled */
#define US_IMR_LIN_RXBUFF_Pos       12           /**< \brief (US_IMR_LIN) Buffer Full Interrupt Mask */
#define US_IMR_LIN_RXBUFF           (0x1u << US_IMR_LIN_RXBUFF_Pos)
#define   US_IMR_LIN_RXBUFF_0       (0x0u << 12) /**< \brief (US_IMR_LIN) The interrupt is disabled */
#define   US_IMR_LIN_RXBUFF_1       (0x1u << 12) /**< \brief (US_IMR_LIN) The interrupt is enabled */
#define US_IMR_LIN_NACK_Pos         13           /**< \brief (US_IMR_LIN) Non Acknowledge  or LIN Break Sent or LIN Break Received Interrupt Mask */
#define US_IMR_LIN_NACK             (0x1u << US_IMR_LIN_NACK_Pos)
#define   US_IMR_LIN_NACK_0         (0x0u << 13) /**< \brief (US_IMR_LIN) The interrupt is disabled */
#define   US_IMR_LIN_NACK_1         (0x1u << 13) /**< \brief (US_IMR_LIN) The interrupt is enabled */
#define US_IMR_LIN_LINID_Pos        14           /**< \brief (US_IMR_LIN) LIN Identifier Sent or LIN Received Interrupt Mask */
#define US_IMR_LIN_LINID            (0x1u << US_IMR_LIN_LINID_Pos)
#define US_IMR_LIN_LINTC_Pos        15           /**< \brief (US_IMR_LIN) LIN Transfer Conpleted Interrupt Mask */
#define US_IMR_LIN_LINTC            (0x1u << US_IMR_LIN_LINTC_Pos)
#define US_IMR_LIN_RIIC_Pos         16           /**< \brief (US_IMR_LIN) Ring Indicator Input Change Mask */
#define US_IMR_LIN_RIIC             (0x1u << US_IMR_LIN_RIIC_Pos)
#define   US_IMR_LIN_RIIC_0         (0x0u << 16) /**< \brief (US_IMR_LIN) The interrupt is disabled */
#define   US_IMR_LIN_RIIC_1         (0x1u << 16) /**< \brief (US_IMR_LIN) The interrupt is enabled */
#define US_IMR_LIN_DSRIC_Pos        17           /**< \brief (US_IMR_LIN) Data Set Ready Input Change Mask */
#define US_IMR_LIN_DSRIC            (0x1u << US_IMR_LIN_DSRIC_Pos)
#define   US_IMR_LIN_DSRIC_0        (0x0u << 17) /**< \brief (US_IMR_LIN) The interrupt is disabled */
#define   US_IMR_LIN_DSRIC_1        (0x1u << 17) /**< \brief (US_IMR_LIN) The interrupt is enabled */
#define US_IMR_LIN_DCDIC_Pos        18           /**< \brief (US_IMR_LIN) Data Carrier Detect Input Change Interrupt Mask */
#define US_IMR_LIN_DCDIC            (0x1u << US_IMR_LIN_DCDIC_Pos)
#define   US_IMR_LIN_DCDIC_0        (0x0u << 18) /**< \brief (US_IMR_LIN) The interrupt is disabled */
#define   US_IMR_LIN_DCDIC_1        (0x1u << 18) /**< \brief (US_IMR_LIN) The interrupt is enabled */
#define US_IMR_LIN_CTSIC_Pos        19           /**< \brief (US_IMR_LIN) Clear to Send Input Change Interrupt Mask */
#define US_IMR_LIN_CTSIC            (0x1u << US_IMR_LIN_CTSIC_Pos)
#define   US_IMR_LIN_CTSIC_0        (0x0u << 19) /**< \brief (US_IMR_LIN) The interrupt is disabled */
#define   US_IMR_LIN_CTSIC_1        (0x1u << 19) /**< \brief (US_IMR_LIN) The interrupt is enabled */
#define US_IMR_LIN_LINBE_Pos        25           /**< \brief (US_IMR_LIN) LIN Bus Error Interrupt Mask */
#define US_IMR_LIN_LINBE            (0x1u << US_IMR_LIN_LINBE_Pos)
#define US_IMR_LIN_LINISFE_Pos      26           /**< \brief (US_IMR_LIN) LIN Inconsistent Synch Field Error Interrupt Mask */
#define US_IMR_LIN_LINISFE          (0x1u << US_IMR_LIN_LINISFE_Pos)
#define US_IMR_LIN_LINIPE_Pos       27           /**< \brief (US_IMR_LIN) LIN Identifier Parity Interrupt Mask */
#define US_IMR_LIN_LINIPE           (0x1u << US_IMR_LIN_LINIPE_Pos)
#define US_IMR_LIN_LINCE_Pos        28           /**< \brief (US_IMR_LIN) LIN Checksum Error Interrupt Mask */
#define US_IMR_LIN_LINCE            (0x1u << US_IMR_LIN_LINCE_Pos)
#define US_IMR_LIN_LINSNRE_Pos      29           /**< \brief (US_IMR_LIN) LIN Slave Not Responding Error Interrupt Mask */
#define US_IMR_LIN_LINSNRE          (0x1u << US_IMR_LIN_LINSNRE_Pos)
#define US_IMR_LIN_LINSTE_Pos       30           /**< \brief (US_IMR_LIN) LIN Synch Tolerance Error Interrupt Mask */
#define US_IMR_LIN_LINSTE           (0x1u << US_IMR_LIN_LINSTE_Pos)
#define   US_IMR_LIN_LINSTE_0       (0x0u << 30) /**< \brief (US_IMR_LIN) The interrupt is disabled */
#define   US_IMR_LIN_LINSTE_1       (0x1u << 30) /**< \brief (US_IMR_LIN) The interrupt is enabled */
#define US_IMR_LIN_LINHTE_Pos       31           /**< \brief (US_IMR_LIN) LIN Header Timeout Error Interrupt Mask */
#define US_IMR_LIN_LINHTE           (0x1u << US_IMR_LIN_LINHTE_Pos)
#define   US_IMR_LIN_LINHTE_0       (0x0u << 31) /**< \brief (US_IMR_LIN) The interrupt is disabled */
#define   US_IMR_LIN_LINHTE_1       (0x1u << 31) /**< \brief (US_IMR_LIN) The interrupt is enabled */
#define US_IMR_LIN_MASK             0xFE0FFFFFu  /**< \brief (US_IMR_LIN) MASK Register */

// SPI_SLAVE mode
#define US_IMR_SPI_SLAVE_RXRDY_Pos  0            /**< \brief (US_IMR_SPI_SLAVE) RXRDY Interrupt Mask */
#define US_IMR_SPI_SLAVE_RXRDY      (0x1u << US_IMR_SPI_SLAVE_RXRDY_Pos)
#define   US_IMR_SPI_SLAVE_RXRDY_0  (0x0u <<  0) /**< \brief (US_IMR_SPI_SLAVE) The interrupt is disabled */
#define   US_IMR_SPI_SLAVE_RXRDY_1  (0x1u <<  0) /**< \brief (US_IMR_SPI_SLAVE) The interrupt is enabled */
#define US_IMR_SPI_SLAVE_TXRDY_Pos  1            /**< \brief (US_IMR_SPI_SLAVE) TXRDY Interrupt Mask */
#define US_IMR_SPI_SLAVE_TXRDY      (0x1u << US_IMR_SPI_SLAVE_TXRDY_Pos)
#define   US_IMR_SPI_SLAVE_TXRDY_0  (0x0u <<  1) /**< \brief (US_IMR_SPI_SLAVE) The interrupt is disabled */
#define   US_IMR_SPI_SLAVE_TXRDY_1  (0x1u <<  1) /**< \brief (US_IMR_SPI_SLAVE) The interrupt is enabled */
#define US_IMR_SPI_SLAVE_RXBRK_Pos  2            /**< \brief (US_IMR_SPI_SLAVE) Receiver Break Interrupt Mask */
#define US_IMR_SPI_SLAVE_RXBRK      (0x1u << US_IMR_SPI_SLAVE_RXBRK_Pos)
#define   US_IMR_SPI_SLAVE_RXBRK_0  (0x0u <<  2) /**< \brief (US_IMR_SPI_SLAVE) The interrupt is disabled */
#define   US_IMR_SPI_SLAVE_RXBRK_1  (0x1u <<  2) /**< \brief (US_IMR_SPI_SLAVE) The interrupt is enabled */
#define US_IMR_SPI_SLAVE_ENDRX_Pos  3            /**< \brief (US_IMR_SPI_SLAVE) End of Receive Transfer Interrupt Mask */
#define US_IMR_SPI_SLAVE_ENDRX      (0x1u << US_IMR_SPI_SLAVE_ENDRX_Pos)
#define   US_IMR_SPI_SLAVE_ENDRX_0  (0x0u <<  3) /**< \brief (US_IMR_SPI_SLAVE) The interrupt is disabled */
#define   US_IMR_SPI_SLAVE_ENDRX_1  (0x1u <<  3) /**< \brief (US_IMR_SPI_SLAVE) The interrupt is enabled */
#define US_IMR_SPI_SLAVE_ENDTX_Pos  4            /**< \brief (US_IMR_SPI_SLAVE) End of Transmit Interrupt Mask */
#define US_IMR_SPI_SLAVE_ENDTX      (0x1u << US_IMR_SPI_SLAVE_ENDTX_Pos)
#define   US_IMR_SPI_SLAVE_ENDTX_0  (0x0u <<  4) /**< \brief (US_IMR_SPI_SLAVE) The interrupt is disabled */
#define   US_IMR_SPI_SLAVE_ENDTX_1  (0x1u <<  4) /**< \brief (US_IMR_SPI_SLAVE) The interrupt is enabled */
#define US_IMR_SPI_SLAVE_OVRE_Pos   5            /**< \brief (US_IMR_SPI_SLAVE) Overrun Error Interrupt Mask */
#define US_IMR_SPI_SLAVE_OVRE       (0x1u << US_IMR_SPI_SLAVE_OVRE_Pos)
#define   US_IMR_SPI_SLAVE_OVRE_0   (0x0u <<  5) /**< \brief (US_IMR_SPI_SLAVE) The interrupt is disabled */
#define   US_IMR_SPI_SLAVE_OVRE_1   (0x1u <<  5) /**< \brief (US_IMR_SPI_SLAVE) The interrupt is enabled */
#define US_IMR_SPI_SLAVE_FRAME_Pos  6            /**< \brief (US_IMR_SPI_SLAVE) Framing Error Interrupt Mask */
#define US_IMR_SPI_SLAVE_FRAME      (0x1u << US_IMR_SPI_SLAVE_FRAME_Pos)
#define   US_IMR_SPI_SLAVE_FRAME_0  (0x0u <<  6) /**< \brief (US_IMR_SPI_SLAVE) The interrupt is disabled */
#define   US_IMR_SPI_SLAVE_FRAME_1  (0x1u <<  6) /**< \brief (US_IMR_SPI_SLAVE) The interrupt is enabled */
#define US_IMR_SPI_SLAVE_PARE_Pos   7            /**< \brief (US_IMR_SPI_SLAVE) Parity Error Interrupt Mask */
#define US_IMR_SPI_SLAVE_PARE       (0x1u << US_IMR_SPI_SLAVE_PARE_Pos)
#define   US_IMR_SPI_SLAVE_PARE_0   (0x0u <<  7) /**< \brief (US_IMR_SPI_SLAVE) The interrupt is disabled */
#define   US_IMR_SPI_SLAVE_PARE_1   (0x1u <<  7) /**< \brief (US_IMR_SPI_SLAVE) The interrupt is enabled */
#define US_IMR_SPI_SLAVE_TIMEOUT_Pos 8            /**< \brief (US_IMR_SPI_SLAVE) Time-out Interrupt Mask */
#define US_IMR_SPI_SLAVE_TIMEOUT    (0x1u << US_IMR_SPI_SLAVE_TIMEOUT_Pos)
#define   US_IMR_SPI_SLAVE_TIMEOUT_0 (0x0u <<  8) /**< \brief (US_IMR_SPI_SLAVE) The interrupt is disabled */
#define   US_IMR_SPI_SLAVE_TIMEOUT_1 (0x1u <<  8) /**< \brief (US_IMR_SPI_SLAVE) The interrupt is enabled */
#define US_IMR_SPI_SLAVE_TXEMPTY_Pos 9            /**< \brief (US_IMR_SPI_SLAVE) TXEMPTY Interrupt Mask */
#define US_IMR_SPI_SLAVE_TXEMPTY    (0x1u << US_IMR_SPI_SLAVE_TXEMPTY_Pos)
#define   US_IMR_SPI_SLAVE_TXEMPTY_0 (0x0u <<  9) /**< \brief (US_IMR_SPI_SLAVE) The interrupt is disabled */
#define   US_IMR_SPI_SLAVE_TXEMPTY_1 (0x1u <<  9) /**< \brief (US_IMR_SPI_SLAVE) The interrupt is enabled */
#define US_IMR_SPI_SLAVE_UNRE_Pos   10           /**< \brief (US_IMR_SPI_SLAVE) SPI Underrun Error Interrupt Mask */
#define US_IMR_SPI_SLAVE_UNRE       (0x1u << US_IMR_SPI_SLAVE_UNRE_Pos)
#define   US_IMR_SPI_SLAVE_UNRE_0   (0x0u << 10) /**< \brief (US_IMR_SPI_SLAVE) The interrupt is disabled */
#define   US_IMR_SPI_SLAVE_UNRE_1   (0x1u << 10) /**< \brief (US_IMR_SPI_SLAVE) The interrupt is enabled */
#define US_IMR_SPI_SLAVE_TXBUFE_Pos 11           /**< \brief (US_IMR_SPI_SLAVE) Buffer Empty Interrupt Mask */
#define US_IMR_SPI_SLAVE_TXBUFE     (0x1u << US_IMR_SPI_SLAVE_TXBUFE_Pos)
#define   US_IMR_SPI_SLAVE_TXBUFE_0 (0x0u << 11) /**< \brief (US_IMR_SPI_SLAVE) The interrupt is disabled */
#define   US_IMR_SPI_SLAVE_TXBUFE_1 (0x1u << 11) /**< \brief (US_IMR_SPI_SLAVE) The interrupt is enabled */
#define US_IMR_SPI_SLAVE_RXBUFF_Pos 12           /**< \brief (US_IMR_SPI_SLAVE) Buffer Full Interrupt Mask */
#define US_IMR_SPI_SLAVE_RXBUFF     (0x1u << US_IMR_SPI_SLAVE_RXBUFF_Pos)
#define   US_IMR_SPI_SLAVE_RXBUFF_0 (0x0u << 12) /**< \brief (US_IMR_SPI_SLAVE) The interrupt is disabled */
#define   US_IMR_SPI_SLAVE_RXBUFF_1 (0x1u << 12) /**< \brief (US_IMR_SPI_SLAVE) The interrupt is enabled */
#define US_IMR_SPI_SLAVE_NACK_Pos   13           /**< \brief (US_IMR_SPI_SLAVE) Non Acknowledge Interrupt Mask */
#define US_IMR_SPI_SLAVE_NACK       (0x1u << US_IMR_SPI_SLAVE_NACK_Pos)
#define   US_IMR_SPI_SLAVE_NACK_0   (0x0u << 13) /**< \brief (US_IMR_SPI_SLAVE) The interrupt is disabled */
#define   US_IMR_SPI_SLAVE_NACK_1   (0x1u << 13) /**< \brief (US_IMR_SPI_SLAVE) The interrupt is enabled */
#define US_IMR_SPI_SLAVE_RIIC_Pos   16           /**< \brief (US_IMR_SPI_SLAVE) Ring Indicator Input Change Mask */
#define US_IMR_SPI_SLAVE_RIIC       (0x1u << US_IMR_SPI_SLAVE_RIIC_Pos)
#define   US_IMR_SPI_SLAVE_RIIC_0   (0x0u << 16) /**< \brief (US_IMR_SPI_SLAVE) The interrupt is disabled */
#define   US_IMR_SPI_SLAVE_RIIC_1   (0x1u << 16) /**< \brief (US_IMR_SPI_SLAVE) The interrupt is enabled */
#define US_IMR_SPI_SLAVE_DSRIC_Pos  17           /**< \brief (US_IMR_SPI_SLAVE) Data Set Ready Input Change Mask */
#define US_IMR_SPI_SLAVE_DSRIC      (0x1u << US_IMR_SPI_SLAVE_DSRIC_Pos)
#define   US_IMR_SPI_SLAVE_DSRIC_0  (0x0u << 17) /**< \brief (US_IMR_SPI_SLAVE) The interrupt is disabled */
#define   US_IMR_SPI_SLAVE_DSRIC_1  (0x1u << 17) /**< \brief (US_IMR_SPI_SLAVE) The interrupt is enabled */
#define US_IMR_SPI_SLAVE_DCDIC_Pos  18           /**< \brief (US_IMR_SPI_SLAVE) Data Carrier Detect Input Change Interrupt Mask */
#define US_IMR_SPI_SLAVE_DCDIC      (0x1u << US_IMR_SPI_SLAVE_DCDIC_Pos)
#define   US_IMR_SPI_SLAVE_DCDIC_0  (0x0u << 18) /**< \brief (US_IMR_SPI_SLAVE) The interrupt is disabled */
#define   US_IMR_SPI_SLAVE_DCDIC_1  (0x1u << 18) /**< \brief (US_IMR_SPI_SLAVE) The interrupt is enabled */
#define US_IMR_SPI_SLAVE_CTSIC_Pos  19           /**< \brief (US_IMR_SPI_SLAVE) Clear to Send Input Change Interrupt Mask */
#define US_IMR_SPI_SLAVE_CTSIC      (0x1u << US_IMR_SPI_SLAVE_CTSIC_Pos)
#define   US_IMR_SPI_SLAVE_CTSIC_0  (0x0u << 19) /**< \brief (US_IMR_SPI_SLAVE) The interrupt is disabled */
#define   US_IMR_SPI_SLAVE_CTSIC_1  (0x1u << 19) /**< \brief (US_IMR_SPI_SLAVE) The interrupt is enabled */
#define US_IMR_SPI_SLAVE_MASK       0x000F3FFFu  /**< \brief (US_IMR_SPI_SLAVE) MASK Register */

