Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4l/include/component/component_usart.h
// USART mode
#define US_CSR_USART_RXRDY_Pos      0            /**< \brief (US_CSR_USART) Receiver Ready */
#define US_CSR_USART_RXRDY          (0x1u << US_CSR_USART_RXRDY_Pos)
#define   US_CSR_USART_RXRDY_0      (0x0u <<  0) /**< \brief (US_CSR_USART) No complete character has been received since the last read of RHR or the receiver is disabled. If characters werebeing received when the receiver was disabled, RXRDY changes to 1 when the receiver is enabled */
#define   US_CSR_USART_RXRDY_1      (0x1u <<  0) /**< \brief (US_CSR_USART) At least one complete character has been received and RHR has not yet been read */
#define US_CSR_USART_TXRDY_Pos      1            /**< \brief (US_CSR_USART) Transmitter Ready */
#define US_CSR_USART_TXRDY          (0x1u << US_CSR_USART_TXRDY_Pos)
#define   US_CSR_USART_TXRDY_0      (0x0u <<  1) /**< \brief (US_CSR_USART) A character is in the THR waiting to be transferred to the Transmit Shift Register, or an STTBRK command has been requested, or the transmitter is disabled. As soon as the transmitter is enabled, TXRDY becomes 1 */
#define   US_CSR_USART_TXRDY_1      (0x1u <<  1) /**< \brief (US_CSR_USART) There is no character in the THR */
#define US_CSR_USART_RXBRK_Pos      2            /**< \brief (US_CSR_USART) Break Received/End of Break */
#define US_CSR_USART_RXBRK          (0x1u << US_CSR_USART_RXBRK_Pos)
#define   US_CSR_USART_RXBRK_0      (0x0u <<  2) /**< \brief (US_CSR_USART) No Break received or End of Break detected since the last RSTSTA */
#define   US_CSR_USART_RXBRK_1      (0x1u <<  2) /**< \brief (US_CSR_USART) Break Received or End of Break detected since the last RSTSTA */
#define US_CSR_USART_OVRE_Pos       5            /**< \brief (US_CSR_USART) Overrun Error */
#define US_CSR_USART_OVRE           (0x1u << US_CSR_USART_OVRE_Pos)
#define   US_CSR_USART_OVRE_0       (0x0u <<  5) /**< \brief (US_CSR_USART) No overrun error has occurred since since the last RSTSTA */
#define   US_CSR_USART_OVRE_1       (0x1u <<  5) /**< \brief (US_CSR_USART) At least one overrun error has occurred since the last RSTSTA */
#define US_CSR_USART_FRAME_Pos      6            /**< \brief (US_CSR_USART) Framing Error */
#define US_CSR_USART_FRAME          (0x1u << US_CSR_USART_FRAME_Pos)
#define   US_CSR_USART_FRAME_0      (0x0u <<  6) /**< \brief (US_CSR_USART) No stop bit has been detected low since the last RSTSTA */
#define   US_CSR_USART_FRAME_1      (0x1u <<  6) /**< \brief (US_CSR_USART) At least one stop bit has been detected low since the last RSTSTA */
#define US_CSR_USART_PARE_Pos       7            /**< \brief (US_CSR_USART) Parity Error */
#define US_CSR_USART_PARE           (0x1u << US_CSR_USART_PARE_Pos)
#define   US_CSR_USART_PARE_0       (0x0u <<  7) /**< \brief (US_CSR_USART) No parity error has been detected since the last RSTSTA */
#define   US_CSR_USART_PARE_1       (0x1u <<  7) /**< \brief (US_CSR_USART) At least one parity error has been detected since the last RSTSTA */
#define US_CSR_USART_TIMEOUT_Pos    8            /**< \brief (US_CSR_USART) Receiver Time-out */
#define US_CSR_USART_TIMEOUT        (0x1u << US_CSR_USART_TIMEOUT_Pos)
#define   US_CSR_USART_TIMEOUT_0    (0x0u <<  8) /**< \brief (US_CSR_USART) There has not been a time-out since the last Start Time-out command or the Time-out Register is 0 */
#define   US_CSR_USART_TIMEOUT_1    (0x1u <<  8) /**< \brief (US_CSR_USART) There has been a time-out since the last Start Time-out command */
#define US_CSR_USART_TXEMPTY_Pos    9            /**< \brief (US_CSR_USART) Transmitter Empty */
#define US_CSR_USART_TXEMPTY        (0x1u << US_CSR_USART_TXEMPTY_Pos)
#define   US_CSR_USART_TXEMPTY_0    (0x0u <<  9) /**< \brief (US_CSR_USART) There are characters in either THR or the Transmit Shift Register, or the transmitter is disabled */
#define   US_CSR_USART_TXEMPTY_1    (0x1u <<  9) /**< \brief (US_CSR_USART) There is at least one character in either THR or the Transmit Shift Register */
#define US_CSR_USART_ITER_Pos       10           /**< \brief (US_CSR_USART) Max number of Repetitions Reached */
#define US_CSR_USART_ITER           (0x1u << US_CSR_USART_ITER_Pos)
#define   US_CSR_USART_ITER_0       (0x0u << 10) /**< \brief (US_CSR_USART) Maximum number of repetitions has not been reached since the last RSIT */
#define   US_CSR_USART_ITER_1       (0x1u << 10) /**< \brief (US_CSR_USART) Maximum number of repetitions has been reached since the last RSIT */
#define US_CSR_USART_RXBUFF_Pos     12           /**< \brief (US_CSR_USART) Reception Buffer Full */
#define US_CSR_USART_RXBUFF         (0x1u << US_CSR_USART_RXBUFF_Pos)
#define   US_CSR_USART_RXBUFF_0     (0x0u << 12) /**< \brief (US_CSR_USART) The signal Buffer Full from the Receive PDC channel is inactive */
#define   US_CSR_USART_RXBUFF_1     (0x1u << 12) /**< \brief (US_CSR_USART) The signal Buffer Full from the Receive PDC channel is active */
#define US_CSR_USART_NACK_Pos       13           /**< \brief (US_CSR_USART) Non Acknowledge */
#define US_CSR_USART_NACK           (0x1u << US_CSR_USART_NACK_Pos)
#define   US_CSR_USART_NACK_0       (0x0u << 13) /**< \brief (US_CSR_USART) No Non Acknowledge has not been detected since the last RSTNACK */
#define   US_CSR_USART_NACK_1       (0x1u << 13) /**< \brief (US_CSR_USART) At least one Non Acknowledge has been detected since the last RSTNACK */
#define US_CSR_USART_RIIC_Pos       16           /**< \brief (US_CSR_USART) Ring Indicator Input Change Flag */
#define US_CSR_USART_RIIC           (0x1u << US_CSR_USART_RIIC_Pos)
#define   US_CSR_USART_RIIC_0       (0x0u << 16) /**< \brief (US_CSR_USART) No input change has been detected on the RI pin since the last read of CSR */
#define   US_CSR_USART_RIIC_1       (0x1u << 16) /**< \brief (US_CSR_USART) At least one input change has been detected on the RI pin since the last read of CSR */
#define US_CSR_USART_DSRIC_Pos      17           /**< \brief (US_CSR_USART) Data Set Ready Input Change Flag */
#define US_CSR_USART_DSRIC          (0x1u << US_CSR_USART_DSRIC_Pos)
#define   US_CSR_USART_DSRIC_0      (0x0u << 17) /**< \brief (US_CSR_USART) No input change has been detected on the DSR pin since the last read of CSR */
#define   US_CSR_USART_DSRIC_1      (0x1u << 17) /**< \brief (US_CSR_USART) At least one input change has been detected on the DSR pin since the last read of CSR */
#define US_CSR_USART_DCDIC_Pos      18           /**< \brief (US_CSR_USART) Data Carrier Detect Input Change Flag */
#define US_CSR_USART_DCDIC          (0x1u << US_CSR_USART_DCDIC_Pos)
#define   US_CSR_USART_DCDIC_0      (0x0u << 18) /**< \brief (US_CSR_USART) No input change has been detected on the DCD pin since the last read of CSR */
#define   US_CSR_USART_DCDIC_1      (0x1u << 18) /**< \brief (US_CSR_USART) At least one input change has been detected on the DCD pin since the last read of CSR */
#define US_CSR_USART_CTSIC_Pos      19           /**< \brief (US_CSR_USART) Clear to Send Input Change Flag */
#define US_CSR_USART_CTSIC          (0x1u << US_CSR_USART_CTSIC_Pos)
#define   US_CSR_USART_CTSIC_0      (0x0u << 19) /**< \brief (US_CSR_USART) No input change has been detected on the CTS pin since the last read of CSR */
#define   US_CSR_USART_CTSIC_1      (0x1u << 19) /**< \brief (US_CSR_USART) At least one input change has been detected on the CTS pin since the last read of CSR */
#define US_CSR_USART_RI_Pos         20           /**< \brief (US_CSR_USART) Image of RI Input */
#define US_CSR_USART_RI             (0x1u << US_CSR_USART_RI_Pos)
#define   US_CSR_USART_RI_0         (0x0u << 20) /**< \brief (US_CSR_USART) RI is at 0 */
#define   US_CSR_USART_RI_1         (0x1u << 20) /**< \brief (US_CSR_USART) RI is at 1 */
#define US_CSR_USART_DSR_Pos        21           /**< \brief (US_CSR_USART) Image of DSR Input */
#define US_CSR_USART_DSR            (0x1u << US_CSR_USART_DSR_Pos)
#define   US_CSR_USART_DSR_0        (0x0u << 21) /**< \brief (US_CSR_USART) DSR is at 0 */
#define   US_CSR_USART_DSR_1        (0x1u << 21) /**< \brief (US_CSR_USART) DSR is at 1 */
#define US_CSR_USART_DCD_Pos        22           /**< \brief (US_CSR_USART) Image of DCD Input */
#define US_CSR_USART_DCD            (0x1u << US_CSR_USART_DCD_Pos)
#define   US_CSR_USART_DCD_0        (0x0u << 22) /**< \brief (US_CSR_USART) DCD is at 0 */
#define   US_CSR_USART_DCD_1        (0x1u << 22) /**< \brief (US_CSR_USART) DCD is at 1 */
#define US_CSR_USART_CTS_Pos        23           /**< \brief (US_CSR_USART) Image of CTS Input */
#define US_CSR_USART_CTS            (0x1u << US_CSR_USART_CTS_Pos)
#define   US_CSR_USART_CTS_0        (0x0u << 23) /**< \brief (US_CSR_USART) CTS is at 0 */
#define   US_CSR_USART_CTS_1        (0x1u << 23) /**< \brief (US_CSR_USART) CTS is at 1 */
#define US_CSR_USART_MANERR_Pos     24           /**< \brief (US_CSR_USART) Manchester Error */
#define US_CSR_USART_MANERR         (0x1u << US_CSR_USART_MANERR_Pos)
#define   US_CSR_USART_MANERR_0     (0x0u << 24) /**< \brief (US_CSR_USART) No Manchester error has been detected since the last RSTSTA */
#define   US_CSR_USART_MANERR_1     (0x1u << 24) /**< \brief (US_CSR_USART) At least one Manchester error has been detected since the last RSTSTA */
#define US_CSR_USART_MASK           0x01FF3FFFu  /**< \brief (US_CSR_USART) MASK Register */

// Any mode
#define US_CSR_RXRDY_Pos            0            /**< \brief (US_CSR) Receiver Ready */
#define US_CSR_RXRDY                (0x1u << US_CSR_RXRDY_Pos)
#define   US_CSR_RXRDY_0            (0x0u <<  0) /**< \brief (US_CSR) No complete character has been received since the last read of RHR or the receiver is disabled. If characters werebeing received when the receiver was disabled, RXRDY changes to 1 when the receiver is enabled */
#define   US_CSR_RXRDY_1            (0x1u <<  0) /**< \brief (US_CSR) At least one complete character has been received and RHR has not yet been read */
#define US_CSR_TXRDY_Pos            1            /**< \brief (US_CSR) Transmitter Ready */
#define US_CSR_TXRDY                (0x1u << US_CSR_TXRDY_Pos)
#define   US_CSR_TXRDY_0            (0x0u <<  1) /**< \brief (US_CSR) A character is in the THR waiting to be transferred to the Transmit Shift Register, or an STTBRK command has been requested, or the transmitter is disabled. As soon as the transmitter is enabled, TXRDY becomes 1 */
#define   US_CSR_TXRDY_1            (0x1u <<  1) /**< \brief (US_CSR) There is no character in the THR */
#define US_CSR_RXBRK_Pos            2            /**< \brief (US_CSR) Break Received/End of Break */
#define US_CSR_RXBRK                (0x1u << US_CSR_RXBRK_Pos)
#define   US_CSR_RXBRK_0            (0x0u <<  2) /**< \brief (US_CSR) No Break received or End of Break detected since the last RSTSTA */
#define   US_CSR_RXBRK_1            (0x1u <<  2) /**< \brief (US_CSR) Break Received or End of Break detected since the last RSTSTA */
#define US_CSR_OVRE_Pos             5            /**< \brief (US_CSR) Overrun Error */
#define US_CSR_OVRE                 (0x1u << US_CSR_OVRE_Pos)
#define   US_CSR_OVRE_0             (0x0u <<  5) /**< \brief (US_CSR) No overrun error has occurred since since the last RSTSTA */
#define   US_CSR_OVRE_1             (0x1u <<  5) /**< \brief (US_CSR) At least one overrun error has occurred since the last RSTSTA */
#define US_CSR_FRAME_Pos            6            /**< \brief (US_CSR) Framing Error */
#define US_CSR_FRAME                (0x1u << US_CSR_FRAME_Pos)
#define   US_CSR_FRAME_0            (0x0u <<  6) /**< \brief (US_CSR) No stop bit has been detected low since the last RSTSTA */
#define   US_CSR_FRAME_1            (0x1u <<  6) /**< \brief (US_CSR) At least one stop bit has been detected low since the last RSTSTA */
#define US_CSR_PARE_Pos             7            /**< \brief (US_CSR) Parity Error */
#define US_CSR_PARE                 (0x1u << US_CSR_PARE_Pos)
#define   US_CSR_PARE_0             (0x0u <<  7) /**< \brief (US_CSR) No parity error has been detected since the last RSTSTA */
#define   US_CSR_PARE_1             (0x1u <<  7) /**< \brief (US_CSR) At least one parity error has been detected since the last RSTSTA */
#define US_CSR_TIMEOUT_Pos          8            /**< \brief (US_CSR) Receiver Time-out */
#define US_CSR_TIMEOUT              (0x1u << US_CSR_TIMEOUT_Pos)
#define   US_CSR_TIMEOUT_0          (0x0u <<  8) /**< \brief (US_CSR) There has not been a time-out since the last Start Time-out command or the Time-out Register is 0 */
#define   US_CSR_TIMEOUT_1          (0x1u <<  8) /**< \brief (US_CSR) There has been a time-out since the last Start Time-out command */
#define US_CSR_TXEMPTY_Pos          9            /**< \brief (US_CSR) Transmitter Empty */
#define US_CSR_TXEMPTY              (0x1u << US_CSR_TXEMPTY_Pos)
#define   US_CSR_TXEMPTY_0          (0x0u <<  9) /**< \brief (US_CSR) There are characters in either THR or the Transmit Shift Register, or the transmitter is disabled */
#define   US_CSR_TXEMPTY_1          (0x1u <<  9) /**< \brief (US_CSR) There is at least one character in either THR or the Transmit Shift Register */
#define US_CSR_ITER_Pos             10           /**< \brief (US_CSR) Max number of Repetitions Reached */
#define US_CSR_ITER                 (0x1u << US_CSR_ITER_Pos)
#define   US_CSR_ITER_0             (0x0u << 10) /**< \brief (US_CSR) Maximum number of repetitions has not been reached since the last RSIT */
#define   US_CSR_ITER_1             (0x1u << 10) /**< \brief (US_CSR) Maximum number of repetitions has been reached since the last RSIT */
#define US_CSR_UNRE_Pos             10           /**< \brief (US_CSR) SPI Underrun Error */
#define US_CSR_UNRE                 (0x1u << US_CSR_UNRE_Pos)
#define   US_CSR_UNRE_0             (0x0u << 10) /**< \brief (US_CSR) No SPI underrun error has occurred since the last RSTSTA */
#define   US_CSR_UNRE_1             (0x1u << 10) /**< \brief (US_CSR) At least one SPI underrun error has occurred since the last RSTSTA */
#define US_CSR_ITER_Pos             10           /**< \brief (US_CSR) Max number of Repetitions Reached */
#define US_CSR_ITER                 (0x1u << US_CSR_ITER_Pos)
#define   US_CSR_ITER_0             (0x0u << 10) /**< \brief (US_CSR) Maximum number of repetitions has not been reached since the last RSIT */
#define   US_CSR_ITER_1             (0x1u << 10) /**< \brief (US_CSR) Maximum number of repetitions has been reached since the last RSIT */
#define US_CSR_RXBUFF_Pos           12           /**< \brief (US_CSR) Reception Buffer Full */
#define US_CSR_RXBUFF               (0x1u << US_CSR_RXBUFF_Pos)
#define   US_CSR_RXBUFF_0           (0x0u << 12) /**< \brief (US_CSR) The signal Buffer Full from the Receive PDC channel is inactive */
#define   US_CSR_RXBUFF_1           (0x1u << 12) /**< \brief (US_CSR) The signal Buffer Full from the Receive PDC channel is active */
#define US_CSR_NACK_Pos             13           /**< \brief (US_CSR) Non Acknowledge or LIN Break Sent or LIN Break Received */
#define US_CSR_NACK                 (0x1u << US_CSR_NACK_Pos)
#define   US_CSR_NACK_0             (0x0u << 13) /**< \brief (US_CSR) No Non Acknowledge has not been detected since the last RSTNACK */
#define   US_CSR_NACK_1             (0x1u << 13) /**< \brief (US_CSR) At least one Non Acknowledge has been detected since the last RSTNACK */
#define US_CSR_LINID_Pos            14           /**< \brief (US_CSR) LIN Identifier Sent or LIN Identifier Received */
#define US_CSR_LINID                (0x1u << US_CSR_LINID_Pos)
#define US_CSR_LINTC_Pos            15           /**< \brief (US_CSR) LIN Transfer Conpleted */
#define US_CSR_LINTC                (0x1u << US_CSR_LINTC_Pos)
#define US_CSR_RIIC_Pos             16           /**< \brief (US_CSR) Ring Indicator Input Change Flag */
#define US_CSR_RIIC                 (0x1u << US_CSR_RIIC_Pos)
#define   US_CSR_RIIC_0             (0x0u << 16) /**< \brief (US_CSR) No input change has been detected on the RI pin since the last read of CSR */
#define   US_CSR_RIIC_1             (0x1u << 16) /**< \brief (US_CSR) At least one input change has been detected on the RI pin since the last read of CSR */
#define US_CSR_DSRIC_Pos            17           /**< \brief (US_CSR) Data Set Ready Input Change Flag */
#define US_CSR_DSRIC                (0x1u << US_CSR_DSRIC_Pos)
#define   US_CSR_DSRIC_0            (0x0u << 17) /**< \brief (US_CSR) No input change has been detected on the DSR pin since the last read of CSR */
#define   US_CSR_DSRIC_1            (0x1u << 17) /**< \brief (US_CSR) At least one input change has been detected on the DSR pin since the last read of CSR */
#define US_CSR_DCDIC_Pos            18           /**< \brief (US_CSR) Data Carrier Detect Input Change Flag */
#define US_CSR_DCDIC                (0x1u << US_CSR_DCDIC_Pos)
#define   US_CSR_DCDIC_0            (0x0u << 18) /**< \brief (US_CSR) No input change has been detected on the DCD pin since the last read of CSR */
#define   US_CSR_DCDIC_1            (0x1u << 18) /**< \brief (US_CSR) At least one input change has been detected on the DCD pin since the last read of CSR */
#define US_CSR_CTSIC_Pos            19           /**< \brief (US_CSR) Clear to Send Input Change Flag */
#define US_CSR_CTSIC                (0x1u << US_CSR_CTSIC_Pos)
#define   US_CSR_CTSIC_0            (0x0u << 19) /**< \brief (US_CSR) No input change has been detected on the CTS pin since the last read of CSR */
#define   US_CSR_CTSIC_1            (0x1u << 19) /**< \brief (US_CSR) At least one input change has been detected on the CTS pin since the last read of CSR */
#define US_CSR_RI_Pos               20           /**< \brief (US_CSR) Image of RI Input */
#define US_CSR_RI                   (0x1u << US_CSR_RI_Pos)
#define   US_CSR_RI_0               (0x0u << 20) /**< \brief (US_CSR) RI is at 0 */
#define   US_CSR_RI_1               (0x1u << 20) /**< \brief (US_CSR) RI is at 1 */
#define US_CSR_DSR_Pos              21           /**< \brief (US_CSR) Image of DSR Input */
#define US_CSR_DSR                  (0x1u << US_CSR_DSR_Pos)
#define   US_CSR_DSR_0              (0x0u << 21) /**< \brief (US_CSR) DSR is at 0 */
#define   US_CSR_DSR_1              (0x1u << 21) /**< \brief (US_CSR) DSR is at 1 */
#define US_CSR_DCD_Pos              22           /**< \brief (US_CSR) Image of DCD Input */
#define US_CSR_DCD                  (0x1u << US_CSR_DCD_Pos)
#define   US_CSR_DCD_0              (0x0u << 22) /**< \brief (US_CSR) DCD is at 0 */
#define   US_CSR_DCD_1              (0x1u << 22) /**< \brief (US_CSR) DCD is at 1 */
#define US_CSR_LINBLS_Pos           23           /**< \brief (US_CSR) LIN Bus Line Status */
#define US_CSR_LINBLS               (0x1u << US_CSR_LINBLS_Pos)
#define   US_CSR_LINBLS_0           (0x0u << 23) /**< \brief (US_CSR) CTS is at 0 */
#define   US_CSR_LINBLS_1           (0x1u << 23) /**< \brief (US_CSR) CTS is at 1 */
#define US_CSR_CTS_Pos              23           /**< \brief (US_CSR) Image of CTS Input */
#define US_CSR_CTS                  (0x1u << US_CSR_CTS_Pos)
#define   US_CSR_CTS_0              (0x0u << 23) /**< \brief (US_CSR) CTS is at 0 */
#define   US_CSR_CTS_1              (0x1u << 23) /**< \brief (US_CSR) CTS is at 1 */
#define US_CSR_MANERR_Pos           24           /**< \brief (US_CSR) Manchester Error */
#define US_CSR_MANERR               (0x1u << US_CSR_MANERR_Pos)
#define   US_CSR_MANERR_0           (0x0u << 24) /**< \brief (US_CSR) No Manchester error has been detected since the last RSTSTA */
#define   US_CSR_MANERR_1           (0x1u << 24) /**< \brief (US_CSR) At least one Manchester error has been detected since the last RSTSTA */
#define US_CSR_LINBE_Pos            25           /**< \brief (US_CSR) LIN Bit Error */
#define US_CSR_LINBE                (0x1u << US_CSR_LINBE_Pos)
#define US_CSR_LINISFE_Pos          26           /**< \brief (US_CSR) LIN Inconsistent Synch Field Error */
#define US_CSR_LINISFE              (0x1u << US_CSR_LINISFE_Pos)
#define US_CSR_LINIPE_Pos           27           /**< \brief (US_CSR) LIN Identifier Parity Error */
#define US_CSR_LINIPE               (0x1u << US_CSR_LINIPE_Pos)
#define US_CSR_LINCE_Pos            28           /**< \brief (US_CSR) LIN Checksum Error */
#define US_CSR_LINCE                (0x1u << US_CSR_LINCE_Pos)
#define US_CSR_LINSNRE_Pos          29           /**< \brief (US_CSR) LIN Slave Not Responding Error */
#define US_CSR_LINSNRE              (0x1u << US_CSR_LINSNRE_Pos)
#define US_CSR_LINSTE_Pos           30           /**< \brief (US_CSR) LIN Synch Tolerance Error */
#define US_CSR_LINSTE               (0x1u << US_CSR_LINSTE_Pos)
#define   US_CSR_LINSTE_0           (0x0u << 30) /**< \brief (US_CSR) COMM_TX is at 0 */
#define   US_CSR_LINSTE_1           (0x1u << 30) /**< \brief (US_CSR) COMM_TX is at 1 */
#define US_CSR_LINHTE_Pos           31           /**< \brief (US_CSR) LIN Header Timeout Error */
#define US_CSR_LINHTE               (0x1u << US_CSR_LINHTE_Pos)
#define   US_CSR_LINHTE_0           (0x0u << 31) /**< \brief (US_CSR) COMM_RX is at 0 */
#define   US_CSR_LINHTE_1           (0x1u << 31) /**< \brief (US_CSR) COMM_RX is at 1 */
#define US_CSR_MASK                 0xFFFFFFFFu  /**< \brief (US_CSR) MASK Register */

/* -------- US_RHR : (USART Offset: 0x18) (R/  32) Receiver Holding Register -------- */
#define US_RHR_OFFSET               0x18         /**< \brief (US_RHR offset) Receiver Holding Register */
#define US_RHR_RESETVALUE           0x00000000   /**< \brief (US_RHR reset_value) Receiver Holding Register */

#define US_RHR_RXCHR_Pos            0            /**< \brief (US_RHR) Received Character */
#define US_RHR_RXCHR_Msk            (0x1FFu << US_RHR_RXCHR_Pos)
#define US_RHR_RXCHR(value)         ((US_RHR_RXCHR_Msk & ((value) << US_RHR_RXCHR_Pos)))
#define US_RHR_RXSYNH_Pos           15           /**< \brief (US_RHR) Received Sync */
#define US_RHR_RXSYNH               (0x1u << US_RHR_RXSYNH_Pos)
#define   US_RHR_RXSYNH_0           (0x0u << 15) /**< \brief (US_RHR) Last character received is a Data */
#define   US_RHR_RXSYNH_1           (0x1u << 15) /**< \brief (US_RHR) Last character received is a Command */
#define US_RHR_MASK                 0x000081FFu  /**< \brief (US_RHR) MASK Register */

