Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4l/include/component/component_usart.h
/* -------- US_VERSION : (USART Offset: 0xFC) (R/  32) Version Register -------- */
#define US_VERSION_OFFSET           0xFC         /**< \brief (US_VERSION offset) Version Register */
#define US_VERSION_RESETVALUE       0x00000602   /**< \brief (US_VERSION reset_value) Version Register */

#define US_VERSION_VERSION_Pos      0            /**< \brief (US_VERSION)  */
#define US_VERSION_VERSION_Msk      (0xFFFu << US_VERSION_VERSION_Pos)
#define US_VERSION_VERSION(value)   ((US_VERSION_VERSION_Msk & ((value) << US_VERSION_VERSION_Pos)))
#define US_VERSION_MFN_Pos          16           /**< \brief (US_VERSION)  */
#define US_VERSION_MFN_Msk          (0xFu << US_VERSION_MFN_Pos)
#define US_VERSION_MFN(value)       ((US_VERSION_MFN_Msk & ((value) << US_VERSION_MFN_Pos)))
#define US_VERSION_MASK             0x000F0FFFu  /**< \brief (US_VERSION) MASK Register */

/** \brief USART hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct {
  WoReg   US_CR;              /**< \brief (USART Offset: 0x00) Control Register */
  RwReg   US_MR;              /**< \brief (USART Offset: 0x04) Mode Register */
  WoReg   US_IER;             /**< \brief (USART Offset: 0x08) Interrupt Enable Register */
  WoReg   US_IDR;             /**< \brief (USART Offset: 0x0C) Interrupt Disable Register */
  RoReg   US_IMR;             /**< \brief (USART Offset: 0x10) Interrupt Mask Register */
  RoReg   US_CSR;             /**< \brief (USART Offset: 0x14) Channel Status Register */
  RoReg   US_RHR;             /**< \brief (USART Offset: 0x18) Receiver Holding Register */
  WoReg   US_THR;             /**< \brief (USART Offset: 0x1C) Transmitter Holding Register */
  RwReg   US_BRGR;            /**< \brief (USART Offset: 0x20) Baud Rate Generator Register */
  RwReg   US_RTOR;            /**< \brief (USART Offset: 0x24) Receiver Time-out Register */
  RwReg   US_TTGR;            /**< \brief (USART Offset: 0x28) Transmitter Timeguard Register */
  RoReg8  Reserved1[0x14];
  RwReg   US_FIDI;            /**< \brief (USART Offset: 0x40) FI DI Ratio Register */
  RoReg   US_NER;             /**< \brief (USART Offset: 0x44) Number of Errors Register */
  RoReg8  Reserved2[0x4];
  RwReg   US_IFR;             /**< \brief (USART Offset: 0x4C) IrDA Filter Register */
  RwReg   US_MAN;             /**< \brief (USART Offset: 0x50) Manchester Configuration Register */
  RwReg   US_LINMR;           /**< \brief (USART Offset: 0x54) LIN Mode Register */
  RwReg   US_LINIR;           /**< \brief (USART Offset: 0x58) LIN Identifier Register */
  RoReg   US_LINBRR;          /**< \brief (USART Offset: 0x5C) LIN Baud Rate Register */
  RoReg8  Reserved3[0x84];
  RwReg   US_WPMR;            /**< \brief (USART Offset: 0xE4) Write Protect Mode Register */
  RoReg   US_WPSR;            /**< \brief (USART Offset: 0xE8) Write Protect Status Register */
  RoReg8  Reserved4[0x10];
  RoReg   US_VERSION;         /**< \brief (USART Offset: 0xFC) Version Register */
} Usart;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

#endif /* _SAM4L_USART_COMPONENT_ */
